# MariaDB SQL

## Administrative SQL Statements 

Documentação oficial MariaDB: https://mariadb.com/kb/en/about-show/

### Show databases

In [ ]:
SHOW databases;

### Use

In [ ]:
USE employees;

### Show tables

In [ ]:
SHOW tables;

O modificador `FULL` retorna uma segunda coluna `Table_type`. Os valores desta coluna podem ser: `BASE TABLE` para uma tabela, `VIEW` para uma view ou `SEQUENCE` para uma sequência.

In [ ]:
SHOW FULL TABLES;

In [ ]:
SHOW FULL TABLES WHERE Tables_in_employees LIKE 'd%';

In [ ]:
SHOW TABLE STATUS;

### Show create table

In [ ]:
SHOW CREATE TABLE salaries;

### Data Definition - Databases

#### Create Database

**Exemplo dos Táxis**

<img src="../../resources/images/TaxiER.png" width="1000px">

Baseado no exemplo criado por prof. Geovane Cayres Magalhães http://www.ic.unicamp.br/~geovane/mo410-091/caso.html

In [ ]:
CREATE database if NOT exists taxis;

In [ ]:
USE taxis;

In [ ]:
show tables;

In [ ]:
show databases;

#### Drop Database

In [ ]:
DROP database if exists taxis;

In [ ]:
show databases;

In [ ]:
CREATE database if NOT exists taxis;
USE taxis;

### Data Definition - Tables

#### Create Table

In [ ]:
SHOW tables;

In [ ]:
CREATE TABLE Taxi (
  Placa VARCHAR(7) NOT NULL,
  Marca VARCHAR(30) NOT NULL,
  Modelo VARCHAR(30) NOT NULL,
  AnoFab INTEGER,
  Licenca VARCHAR(9),
  PRIMARY KEY(Placa)
);

In [ ]:
SHOW tables;

##### Data types
<img src="https://www.mysqltutorial.org/wp-content/uploads/0211/03/MySQL-Data-Types.jpg" width="65%">

Indicando:
- Chave primária
- Tipos de dados e constraints (tamanho)
- Criar se não existir

In [ ]:
CREATE TABLE IF NOT EXISTS Taxi (
  Placa VARCHAR(7) NOT NULL,
  Marca VARCHAR(30) NOT NULL,
  Modelo VARCHAR(30) NOT NULL,
  AnoFab INTEGER,
  Licenca VARCHAR(9),
  PRIMARY KEY(Placa)
);

CREATE TABLE IF NOT EXISTS Cliente (
  CliId VARCHAR(4) NOT NULL,
  Nome VARCHAR(80) NOT NULL,
  CPF VARCHAR(14) NOT NULL,
  PRIMARY KEY(CliId)
);

##### Chaves estrangeiras

Ações para chaves estrangeiras
- NO ACTION → impede a ação na tabela mestre <tabela_ref>
- CASCADE → propaga a ação da tabela mestre
- SET NULL → valores de referências alterados para nulo
- SET DEFAULT → valores de referências alterados para default

In [ ]:
CREATE TABLE Corrida (
  CliId VARCHAR(4) NOT NULL,
  Placa VARCHAR(7) NOT NULL,
  DataPedido DATE NOT NULL,
  PRIMARY KEY(CliId, Placa, DataPedido),
  FOREIGN KEY(CliId)
    REFERENCES Cliente(CliId)
      ON DELETE NO ACTION
      ON UPDATE NO ACTION,
  FOREIGN KEY(Placa)
    REFERENCES Taxi(Placa)
      ON DELETE NO ACTION
      ON UPDATE NO ACTION
);

In [ ]:
SHOW tables;

In [ ]:
SHOW TABLE STATUS;

In [ ]:
SHOW CREATE TABLE Corrida;

#### Rename Table

In [ ]:
RENAME TABLE Cliente TO Cliente_new;

In [ ]:
SHOW tables;

#### Alter Table

In [ ]:
SHOW COLUMNS FROM Cliente_new;

In [ ]:
ALTER TABLE Cliente_new ADD Rg INT;

In [ ]:
SHOW COLUMNS FROM Cliente_new;

In [ ]:
ALTER TABLE Cliente_new MODIFY Rg BIGINT;

In [ ]:
SHOW COLUMNS FROM Corrida;

In [ ]:
ALTER TABLE Cliente_new DROP Rg;

In [ ]:
SHOW COLUMNS FROM Cliente_new;

#### Drop Table

Erro por motivo de relação com outras tabelas (chave estrangeira)

In [ ]:
DROP TABLE IF EXISTS Cliente_new;

In [ ]:
DROP TABLE IF EXISTS Corrida;

In [ ]:
DROP TABLE IF EXISTS Taxi;
DROP TABLE IF EXISTS Cliente_new;

In [ ]:
CREATE TABLE IF NOT EXISTS Taxi (
  Placa VARCHAR(7) NOT NULL,
  Marca VARCHAR(30) NOT NULL,
  Modelo VARCHAR(30) NOT NULL,
  AnoFab INTEGER,
  Licenca VARCHAR(9),
  PRIMARY KEY(Placa)
);

CREATE TABLE Cliente (
  CliId VARCHAR(4) NOT NULL,
  Nome VARCHAR(80) NOT NULL,
  CPF VARCHAR(14) NOT NULL,
  PRIMARY KEY(CliId)
);

CREATE TABLE Corrida (
  CliId VARCHAR(4) NOT NULL,
  Placa VARCHAR(7) NOT NULL,
  DataPedido DATE NOT NULL,
  PRIMARY KEY(CliId, Placa, DataPedido),
  FOREIGN KEY(CliId)
    REFERENCES Cliente(CliId)
      ON DELETE NO ACTION
      ON UPDATE NO ACTION,
  FOREIGN KEY(Placa)
    REFERENCES Taxi(Placa)
      ON DELETE NO ACTION
      ON UPDATE NO ACTION
);

### Overview - Data Manipulation (CRUD)

#### Insert

In [ ]:
SHOW TABLE STATUS;

In [ ]:
INSERT INTO Cliente VALUES ('1532', 'Asdrúbal', '448.754.253-65');
INSERT INTO Cliente VALUES ('1755', 'Doriana', '567.387.387-44');
INSERT INTO Cliente VALUES ('1780', 'Quincas', '546.373.762-02');
INSERT INTO Cliente VALUES ('1888', 'Melissa', '123.456.789-10');

INSERT INTO Taxi VALUES ('DAE6534', 'Ford', 'Fiesta', 1999, 'MN572345');
INSERT INTO Taxi VALUES ('DKL4598', 'Wolkswagen', 'Gol', 2001, 'AU876543');
INSERT INTO Taxi VALUES ('DKL7878', 'Ford', 'Fiesta', 2001, 'OP102938');
INSERT INTO Taxi VALUES ('JDM8776', 'Wolkswagen', 'Santana', 2002, 'QM365923');
INSERT INTO Taxi VALUES ('JJM3692', 'Chevrolet', 'Corsa', 1999, 'UU335577');

INSERT INTO Corrida VALUES ('1755', 'DAE6534', '2003-02-15');
INSERT INTO Corrida VALUES ('1780', 'JDM8776', '2003-02-18');
INSERT INTO Corrida VALUES ('1755', 'DKL7878', '2003-02-16');
INSERT INTO Corrida VALUES ('1780', 'DKL4598', '2003-02-17');
INSERT INTO Corrida VALUES ('1532', 'DKL4598', '2003-02-18');
INSERT INTO Corrida VALUES ('1780', 'DAE6534', '2003-02-16');
INSERT INTO Corrida VALUES ('1755', 'DAE6534', '2003-02-18');
INSERT INTO Corrida VALUES ('1532', 'DKL4598', '2003-02-20');

In [ ]:
SHOW TABLE STATUS;

#### Select

**Todos os Táxis com todos os atributos**:

In [ ]:
SELECT * FROM Taxi;

**Taxis fabricados depois do ano 2000**:

In [ ]:
SELECT * FROM Taxi WHERE AnoFab = 2001;

#### Update

In [ ]:
SELECT * FROM Taxi;

In [ ]:
UPDATE Taxi T
       SET T.AnoFab = 2002
       WHERE T.Placa = 'DKL4598';

In [ ]:
SELECT * FROM Taxi;

#### Delete

**Apagando o Táxi de placa `DAE6534`**:

In [ ]:
SELECT * FROM Corrida;

In [ ]:
DELETE FROM Corrida WHERE Corrida.Placa = "DAE6534";

In [ ]:
SELECT * FROM Corrida;

##### Violação de Integridade

Apagando um Táxi que possui corridas associadas

Este exemplo irá gerar um erro de violação de chave estrangeira.

In [ ]:
SELECT * FROM Taxi;

In [ ]:
DELETE FROM Taxi WHERE Taxi.Placa = 'DKL4598';

# SELECT

**Todos os Táxis com todos os atributos**:

In [ ]:
SELECT * FROM Taxi;

**Marca e Modelo dos Taxis disponíveis**:

In [ ]:
SELECT Marca, Modelo FROM Taxi;

**Taxis fabricados depois do ano 2000**:

In [ ]:
SELECT * FROM Taxi WHERE AnoFab > 2000;

**Placas que comecem com DK**:

In [ ]:
SELECT * FROM Taxi WHERE modelo LIKE '%a%';

**Placas com '7' na penúltima posição**:

In [ ]:
SELECT * FROM Taxi WHERE placa LIKE '%7_';

Chaves estrangeiras# Produto Cartesiano

# PRODUTO CARTESIANO

**Entre Clientes e Corridas**:

In [ ]:
SELECT * FROM Cliente;

In [ ]:
SELECT * FROM Corrida;

In [ ]:
SELECT Cliente.CliId, Cliente.Nome, Corrida.Placa, Corrida.DataPedido
FROM Cliente, Corrida;

# JOIN Implícito

**Cientes e as respectivas corridas - Join Implícito**

In [ ]:
SELECT Cliente.CliId, Cliente.Nome, Corrida.Placa, Corrida.DataPedido
FROM Cliente, Corrida
WHERE Cliente.CliId = Corrida.CliId;

**Modelo de taxi para cada corrida**:

In [ ]:
SELECT Taxi.Modelo
       FROM Corrida, Taxi
       WHERE Corrida.Placa = Taxi.Placa;

**Modelos de Táxi por Cliente (estágio 1)**

In [ ]:
SELECT Cliente.Nome, Corrida.DataPedido, Corrida.Placa, Taxi.Modelo
       FROM Cliente, Corrida, Taxi
       WHERE Cliente.CliId = Corrida.CliId AND Corrida.Placa = Taxi.Placa;

**Modelos de Táxi por Cliente (estágio 2)**:

In [ ]:
SELECT DISTINCT Cliente.Nome, Taxi.Modelo
       FROM Cliente, Corrida, Taxi
       WHERE Cliente.CliId = Corrida.CliId AND Corrida.Placa = Taxi.Placa;

# ORDER BY

**Nome dos clientes ordenado alfabeticamente**:

In [ ]:
SELECT Nome
       FROM Cliente
       ORDER BY Nome DESC ;

**Modelos de taxi e os clientes que os tomaram**

Ordena por Modelo, mas não por Cliente:

In [ ]:
SELECT DISTINCT Cl.Nome, T.Modelo
       FROM Cliente Cl, Corrida Co, Taxi T
       WHERE Cl.CliId = Co.CliId AND
             Co.Placa = T.Placa
       ORDER BY T.Modelo;

Ordena por Modelo e, para cada Modelo, por Cliente:

In [ ]:
SELECT DISTINCT Cl.Nome, T.Modelo
       FROM Cliente Cl, Corrida Co, Taxi T
       WHERE Cl.CliId = Co.CliId AND
             Co.Placa = T.Placa
       ORDER BY  Cl.Nome, T.Modelo;

**Cliente e os modelos de taxi tomados**

Ordena por Cliente, mas não por Modelo:

In [ ]:
SELECT DISTINCT Cl.Nome, T.Modelo
       FROM Cliente Cl, Corrida Co, Taxi T
       WHERE Cl.CliId = Co.CliId AND
             Co.Placa = T.Placa
       ORDER BY Cl.Nome;

Ordena por Cliente e, para cada Cliente, por Modelo

In [ ]:
SELECT DISTINCT Cl.Nome, T.Modelo
       FROM Cliente Cl, Corrida Co, Taxi T
       WHERE Cl.CliId = Co.CliId AND
             Co.Placa = T.Placa
       ORDER BY Cl.Nome, T.Modelo;

# JOINs explícitos 

## INNER JOIN (a.k.a. Join)

Forma explícita de fazer uma junção (produto cartesiano com filtro de igualdade entre chaves). Forma mais enxuta e direta de explicitar o objetivo de fazer uma junção de tabelas.
No fim, SGBD trata explícito e implícito da mesma forma.

Também chamado de Inner Join.

<img src="https://www.codeproject.com/KB/database/Visual_SQL_Joins/INNER_JOIN.png" width="120px">

**Taxis e respectivas corridas (para taxis que fizeram corrida)**:

In [ ]:
SELECT DISTINCT Tx.placa, Tx.modelo, Co.cliid
FROM Corrida Co JOIN Taxi Tx ON Tx.placa = Co.placa;

In [ ]:
SELECT DISTINCT Tx.placa, Tx.modelo, Co.cliid
FROM Corrida Co INNER JOIN Taxi Tx ON Tx.placa = Co.placa;

In [ ]:
SELECT DISTINCT Tx.placa, Tx.modelo, Co.cliid, Cl.nome, Cl.cpf
FROM Corrida Co JOIN Taxi    Tx ON Tx.placa = Co.placa
                JOIN Cliente Cl ON Cl.cliid = Co.cliid
ORDER BY Cl.nome;

### NATURAL JOIN 
Mesmo que join/inner join. Caso os campos possuam o mesmo nome nas duas tabelas, estes serão os critérios da junção.

**IDs de clientes e placas dos taxis que fizeram corridas**:

In [ ]:
SELECT Tx.placa, Co.cliid
       FROM Taxi Tx
            NATURAL JOIN Corrida Co;

## OUTER JOINS
### LEFT OUTER JOIN (LEFT JOIN)

<img src="https://www.codeproject.com/KB/database/Visual_SQL_Joins/LEFT_JOIN.png" width="120px">

**Taxis e respectivas corridas (para todos os taxis)**:

In [ ]:
SELECT Tx.placa, Co.cliid
       FROM Taxi Tx LEFT OUTER JOIN Corrida Co
                           ON Tx.placa = Co.placa;

#### Left Excluding Join
<img src="https://www.codeproject.com/KB/database/Visual_SQL_Joins/LEFT_EXCLUDING_JOIN.png" width="120px">

In [ ]:
SELECT Tx.placa, Co.cliid
       FROM Taxi Tx LEFT JOIN Corrida Co
                           ON Tx.placa = Co.placa
       WHERE Co.placa IS NULL;

### RIGHT OUTER JOIN (RIGHT JOIN)

<img src="https://www.codeproject.com/KB/database/Visual_SQL_Joins/RIGHT_JOIN.png" width="120px">

**Corridas e respectivos clientes (para todos os clientes)**:

In [ ]:
SELECT Co.placa, Cl.nome
       FROM Corrida Co RIGHT JOIN Cliente Cl
                               ON Co.cliid = Cl.cliid;

#### Right Excluding Join
<img src="https://www.codeproject.com/KB/database/Visual_SQL_Joins/RIGHT_EXCLUDING_JOIN.png" width="120px">

In [ ]:
SELECT Co.placa, Cl.nome
       FROM Corrida Co RIGHT JOIN Cliente Cl
                               ON Co.cliid = Cl.cliid   
       WHERE Co.cliid IS NULL;

### FULL OUTER JOIN

<img src="https://www.codeproject.com/KB/database/Visual_SQL_Joins/FULL_OUTER_JOIN.png" width="120px">


Não existe OUTER JOIN no MariaDB/Mysql. Mas há uma alternativa: UNION


**Corridas e clientes (para todos os clientes e corridas)**:

In [ ]:
SELECT Co.placa, Cl.nome
       FROM Corrida Co LEFT JOIN Cliente Cl
                               ON Co.cliid = Cl.cliid
UNION

SELECT Co.placa, Cl.nome
       FROM Corrida Co RIGHT JOIN Cliente Cl
                               ON Co.cliid = Cl.cliid;

#### Full Outer Excluding Join
<img src="https://www.codeproject.com/KB/database/Visual_SQL_Joins/OUTER_EXCLUDING_JOIN.png" width="120px">

# DELETE

**Apagando o Táxi de placa `DAE6534`**:

In [ ]:
SELECT * FROM Corrida order by Placa;

In [ ]:
SELECT * FROM Corrida WHERE Corrida.Placa = "DAE6534";

In [ ]:
DELETE FROM Corrida WHERE Corrida.Placa = "DAE6534";

In [ ]:
SELECT * FROM Corrida;

## Violação de Integridade

**Apagando um Táxi que possui corridas associadas**:

Este exemplo irá gerar um erro de violação de chave estrangeira.

In [ ]:
SELECT * FROM Taxi;

In [ ]:
DELETE FROM Taxi WHERE Taxi.Placa = 'DKL4598';

In [ ]:
SHOW CREATE TABLE Corrida;

# UPDATE

**Alterando o ano de fabricação (para 2002) do Táxi que possui placa `DKL4598`**:SELECT * FROM Taxi ORDER BY Placa;

In [ ]:
SELECT * FROM Taxi ORDER BY Placa;

In [ ]:
SELECT * FROM Taxi WHERE Placa = 'DKL4598' ORDER BY Placa;

In [ ]:
UPDATE Taxi T
       SET T.AnoFab = 2020
       WHERE T.Placa = 'DKL4598';

In [ ]:
SELECT * FROM Taxi ORDER BY Placa;

In [ ]:
UPDATE Taxi T
       SET T.AnoFab = 2021;

In [ ]:
SELECT * FROM Taxi ORDER BY Placa;

# GROUP BY

**Modelos de Táxi cadastrados**:

In [ ]:
SELECT T.Modelo, T.AnoFab
       FROM Taxi T
       GROUP BY T.Modelo, T.AnoFab;

In [ ]:
INSERT INTO Taxi VALUES ('TT3423', 'Chevrolet', 'Corsa', 2020, '712392');

In [ ]:
SELECT * FROM Taxi ORDER BY Placa;



**Modelos de Táxi cadastrados e quantos táxis há em cada modelo:**

In [ ]:
SELECT T.Modelo, COUNT(*)
       FROM Taxi T
       GROUP BY T.Modelo;

In [ ]:
SELECT T.Modelo, AVG(T.AnoFab), MAX(T.AnoFab), MIN(T.AnoFab)
       FROM Taxi T
       GROUP BY T.Modelo;

## Agregando em mais de um nível

**Modelos de taxi tomados por cada cliente (agrupando por Cliente e por Modelo)**:

In [ ]:
SELECT Cl.Nome, COUNT(*)
       FROM Cliente Cl, Corrida Co, Taxi T 
       WHERE Cl.CliId = Co.CliId AND 
             Co.Placa = T.Placa
       GROUP BY Cl.Nome;

In [ ]:
SELECT Cl.Nome, T.Modelo, COUNT(*)
       FROM Cliente Cl, Corrida Co, Taxi T 
       WHERE Cl.CliId = Co.CliId AND 
             Co.Placa = T.Placa
       GROUP BY Cl.Nome, T.Modelo;

## Funções de agregação sem agrupamento

**Média de ano de fabricação para todos os Táxis**

Quando é usada função de agregação sem especificação de agrupamento, toda a tabela é agregada como se fosse um único grupo.

In [ ]:
-- Tabela completa
SELECT AnoFab FROM Taxi;

-- Media do ano de fabricação de toda a tabela
SELECT MAX(AnoFab),MIN(AnoFab),AVG(AnoFab)  FROM Taxi;

## Campos mostrados devem corresponder à agregação

Exemplo sem agregação:

In [ ]:
SELECT Modelo, AnoFab
       FROM Taxi;

**Modelo e Ano de Fabricação**

Este exemplo com agregação produzirá um erro pois `AnoFab` (ano de fabricação) não foi agregado, portanto, pode haver mais de um ano de fabricação para o mesmo modelo.

In [ ]:
SELECT Modelo, AnoFab
       FROM Taxi
       GROUP BY Modelo, AnoFab;

**Modelo e Maior Ano de Fabricação**

Corrigindo com função de agregação

Este exemplo escolhe o maior ano para cada Modelo agregado.

In [ ]:
SELECT Modelo, MAX(AnoFab)
       FROM Taxi
       GROUP BY Modelo;

# HAVING

**Número de Táxis por Modelo somente para os Táxis com ano de fabricação acima de 2000**:

Exemplo com `WHERE` em que a condição é aplicada antes de se agregar:

In [ ]:
-- Todos os Táxis
SELECT * FROM Taxi;

-- Selecionados e Agregados
SELECT Modelo, COUNT(*) NUM
       FROM Taxi
       WHERE AnoFab > 2000
       GROUP BY Modelo;

**Modelos de Táxi que têm mais de um Táxi do respectivo modelo**

Exemplo com `HAVING` em que a condição é aplicada após se agregar:

In [ ]:
-- Agrupamento
SELECT Modelo, COUNT(*) NUM
       FROM Taxi
       GROUP BY Modelo;

-- Agrupamento com HAVING
SELECT Modelo, COUNT(*) contagem_modelos
       FROM Taxi
       GROUP BY Modelo
       HAVING contagem_modelos > 1;

## `HAVING` apenas para campos agregados 

**Modelos daqueles Táxis com ano de fabricação acima de 2000**

A seleção a seguir produzirá um erro pois está se aplicando uma condição `HAVING` para um campo não agregado. Deveria ter sido usado `WHERE` como foi feito anteriormente.

In [ ]:
SELECT Modelo, COUNT(*) NUM
       FROM Taxi
       GROUP BY Modelo
       HAVING AnoFab > 2000;

**Exemplo de `HAVING` com média**

Modelos de Táxi cujo maior Ano de Fabricação seja após 2000:

In [ ]:
SELECT Modelo, MIN(AnoFab) MinAno
       FROM Taxi
       GROUP BY Modelo
       HAVING MinAno > 2000;

# VIEW

**Total de Táxis por Modelo**

Agrupamento sem o uso de `VIEW`:

In [ ]:
SELECT Modelo, COUNT(*) Contagem_Taxis
       FROM Taxi
       GROUP BY Modelo;

**Tabela de Total de Táxis por Modelo**

Transformando o agrupamento na tabela `Contagem_Modelo` com o `VIEW`:

In [ ]:
CREATE VIEW Contagem_Modelos AS
SELECT Modelo, COUNT(*) Numero_Taxis
       FROM Taxi
       GROUP BY Modelo;

In [ ]:
SHOW FULL TABLES;

In [ ]:
SELECT * FROM Contagem_Modelos where Numero_Taxis >1;

Usando a tabela criada com a `VIEW`:

In [ ]:
SELECT AVG(Numero_Taxis) FROM Contagem_Modelos;

**VIEW se auto-atualiza**

A view é um recorte dinâmico, ela se auto-atualiza quando a tabela original é modificada.

In [ ]:
INSERT INTO Taxi VALUES ('KMN3412', 'Chevrolet', 'Corsa', 2001, 'QJ572345');

In [ ]:
SELECT * FROM Taxi;

In [ ]:
SELECT * FROM Contagem_Modelos;